<?php

declare(strict_types=1);

return [
    'file' => [
        'upload' => 'Файл не удалось загрузить!',
        'upload_validation' => 'Загруженный файл недействителен!',
        'rename' => 'Файл не удалось переименовать!',
        'delete' => 'Файл не удалось удалить!',
        'unzip' => 'Файл не удалось распаковать, так как он недействителен или место назначения уже существует!',
    ],

    'folder' => [
        'create' => 'Не удалось создать папку!',
        'rename' => 'Папку не удалось переименовать!',
        'delete' => 'Папку не удалось удалить!',
    ],

    'authorization' => [
        'unauthorized' => 'Это действие [:action] не разрешено.',
    ],
];
